Tekla Open API Reference for Tekla Structures 2025
DrawingSelector.GetSelected Method
 Gets the drawings that are currently selected in the drawing list dialog.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingEnumerator GetSelected()
Public Function GetSelected As DrawingEnumerator
Return Value
Type: DrawingEnumerator
The drawings that are currently selected in the drawing list dialog.
See Also
Reference
DrawingSelector Class
Tekla.Structures.Drawing.UI Namespace